In [1]:
import numpy as np
import pandas as pd

In [2]:
arr=np.array([14,5,6,667,8])

In [3]:
pd.Series(arr)

0     14
1      5
2      6
3    667
4      8
dtype: int32

In [4]:
pd.Series(arr,index=[23,45,67,89,12])

23     14
45      5
67      6
89    667
12      8
dtype: int32

In [8]:
s=arr={'a':2,'b':6,'c':'7','d':'8'}

In [10]:
s=pd.Series(arr)

In [11]:
s

a    2
b    6
c    7
d    8
dtype: object

In [12]:
s[0]

2

In [13]:
s[2:]

c    7
d    8
dtype: object

In [14]:
s[::-1]

d    8
c    7
b    6
a    2
dtype: object

In [15]:
s=pd.Series(['aswini','simran','abhisarika','rani'],index=[1,2,3,4])

In [16]:
s

1        aswini
2        simran
3    abhisarika
4          rani
dtype: object

In [17]:
s[3]

'abhisarika'

In [18]:
s[2]

'simran'

In [19]:

s[1:3]

2        simran
3    abhisarika
dtype: object

In [20]:
s.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [21]:
s.values

array(['aswini', 'simran', 'abhisarika', 'rani'], dtype=object)

In [26]:
data={'name':['aswini','simran','abhisarika','rani'],'age':[22,33,44,55]}
ranks=['rank1','rank2','rank3','rank4']
data=pd.DataFrame(data,index=ranks)

In [27]:
data

             name  age
rank1      aswini   22
rank2      simran   33
rank3  abhisarika   44
rank4        rani   55

In [28]:
data["age"]

rank1    22
rank2    33
rank3    44
rank4    55
Name: age, dtype: int64

In [29]:
data['name']

rank1        aswini
rank2        simran
rank3    abhisarika
rank4          rani
Name: name, dtype: object

In [30]:
data['city']=['bihar','orissa','delhi','afghanistan']

In [31]:
data

             name  age         city
rank1      aswini   22        bihar
rank2      simran   33       orissa
rank3  abhisarika   44        delhi
rank4        rani   55  afghanistan

In [33]:
del data['city']

In [34]:
data

             name  age
rank1      aswini   22
rank2      simran   33
rank3  abhisarika   44
rank4        rani   55

In [35]:
data.pop('age')

rank1    22
rank2    33
rank3    44
rank4    55
Name: age, dtype: int64

In [36]:
data

             name
rank1      aswini
rank2      simran
rank3  abhisarika
rank4        rani

In [2]:
random=np.random.randint(low=0,high=100,size=20)
name=np.random.choice(['A','B','C','D','E'],size=20)
choice=np.random.choice([10,11,12,13,14],size=20)


data={'Random':random,'Name':name,'Choice':choice}
df=pd.DataFrame(data)

df

    Random Name  Choice
0       43    B      13
1       77    D      12
2       41    A      14
3        3    E      11
4       57    D      11
5        4    A      11
6       18    B      11
7       55    E      13
8       30    C      13
9       68    E      11
10      70    D      13
11      43    C      13
12      76    C      11
13      56    B      13
14      34    D      12
15      40    B      10
16      32    B      12
17       2    D      14
18      21    B      11
19      30    C      10

In [41]:
type(df)

pandas.core.frame.DataFrame

In [42]:
df.shape

(20, 3)

In [43]:
df.columns

Index(['Random', 'Name', 'Choice'], dtype='object')

In [44]:
df.values

array([[87, 'D', 14],
       [79, 'B', 14],
       [84, 'A', 11],
       [65, 'A', 11],
       [17, 'E', 13],
       [66, 'B', 11],
       [66, 'B', 10],
       [45, 'D', 10],
       [60, 'B', 10],
       [95, 'D', 10],
       [21, 'B', 10],
       [79, 'E', 14],
       [82, 'A', 11],
       [0, 'B', 14],
       [81, 'D', 12],
       [80, 'A', 10],
       [64, 'A', 12],
       [44, 'A', 10],
       [45, 'A', 11],
       [44, 'E', 14]], dtype=object)

In [46]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Random  20 non-null     int32
 1   Name    20 non-null     object
 2   Choice  20 non-null     int32
dtypes: int32(2), object(1)
memory usage: 448.0+ bytes

In [47]:
df.describe()

          Random    Choice
count  20.000000  20.00000
mean   60.200000  11.60000
std    25.773507   1.63514
min     0.000000  10.00000
25%    44.750000  10.00000
50%    65.500000  11.00000
75%    80.250000  13.25000
max    95.000000  14.00000

In [48]:
df

    Random Name  Choice
0       87    D      14
1       79    B      14
2       84    A      11
3       65    A      11
4       17    E      13
5       66    B      11
6       66    B      10
7       45    D      10
8       60    B      10
9       95    D      10
10      21    B      10
11      79    E      14
12      82    A      11
13       0    B      14
14      81    D      12
15      80    A      10
16      64    A      12
17      44    A      10
18      45    A      11
19      44    E      14

In [3]:
df.set_index(['Random'])

       Name  Choice
Random
43        B      13
77        D      12
41        A      14
3         E      11
57        D      11
4         A      11
18        B      11
55        E      13
30        C      13
68        E      11
70        D      13
43        C      13
76        C      11
56        B      13
34        D      12
40        B      10
32        B      12
2         D      14
21        B      11
30        C      10

In [4]:
df.sort_values(by='Choice',ascending=True)

    Random Name  Choice
19      30    C      10
15      40    B      10
12      76    C      11
18      21    B      11
6       18    B      11
9       68    E      11
4       57    D      11
3        3    E      11
5        4    A      11
14      34    D      12
1       77    D      12
16      32    B      12
7       55    E      13
8       30    C      13
10      70    D      13
11      43    C      13
13      56    B      13
0       43    B      13
2       41    A      14
17       2    D      14

In [5]:
random=np.random.randint(low=0,high=100,size=20)
name=np.random.choice(['A','B','C','D','E'],size=20)
choice=np.random.choice([10,11,12,13,14],size=20)


data={'Random':random,'Name':name,'Choice':choice}
df=pd.DataFrame(data)

df

    Random Name  Choice
0       24    B      14
1       52    D      12
2       58    E      11
3       80    E      10
4       23    A      11
5       89    A      13
6       19    C      13
7       61    E      10
8       73    D      13
9       82    E      13
10      70    E      14
11       9    A      13
12      71    C      13
13      96    A      11
14      90    B      11
15      15    D      10
16       8    B      11
17      40    A      12
18      67    A      13
19      47    A      10

In [6]:
df.iloc[0]

Random    24
Name       B
Choice    14
Name: 0, dtype: object

In [7]:
df.iloc[0,0]

24

In [8]:
df.iloc[:5]

   Random Name  Choice
0      24    B      14
1      52    D      12
2      58    E      11
3      80    E      10
4      23    A      11

In [9]:
df.iloc[:10,:2]

   Random Name
0      24    B
1      52    D
2      58    E
3      80    E
4      23    A
5      89    A
6      19    C
7      61    E
8      73    D
9      82    E

In [12]:
df=pd.read_csv(r'https://raw.githubusercontent.com/vageeshh/Python/main/marks.csv')

In [13]:
df

  Name  Physics  Chemistry  Maths  Biology
0    A       65         69     87       90
1    B       44         76     57       80
2    C       57         85     79       75
3    D       54         66     71       70
4    E       74         86     75       88
5    F       64         67     77       81

In [14]:
df.set_index('Name',inplace=True)

In [15]:
df

      Physics  Chemistry  Maths  Biology
Name
A          65         69     87       90
B          44         76     57       80
C          57         85     79       75
D          54         66     71       70
E          74         86     75       88
F          64         67     77       81

In [16]:
df.loc['A']

Physics      65
Chemistry    69
Maths        87
Biology      90
Name: A, dtype: int64

In [20]:
df.loc[['A','D','F']]

      Physics  Chemistry  Maths  Biology
Name
A          65         69     87       90
D          54         66     71       70
F          64         67     77       81

In [29]:
df.loc[:,['Math','Biology']]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [30]:
dict1 = {
    'Letter':['a','b'],
    'Number':[1,2]
}

#creating dataframe1
d1 = pd.DataFrame(dict1)

In [31]:
d1

  Letter  Number
0      a       1
1      b       2

In [32]:
dict2 = {
    'Letter':['c','d'],
    'Number':[3,4],
    'Animal':['lion','tiger']
}

#creating dataframe2
d2 = pd.DataFrame(dict2)
d2

  Letter  Number Animal
0      c       3   lion
1      d       4  tiger

In [33]:
pd.concat([d1,d2],axis=0)

  Letter  Number Animal
0      a       1    NaN
1      b       2    NaN
0      c       3   lion
1      d       4  tiger

In [34]:
pd.concat([d2,d1],axis=0)

  Letter  Number Animal
0      c       3   lion
1      d       4  tiger
0      a       1    NaN
1      b       2    NaN

In [35]:
pd.concat([d2,d1],axis=1)

  Letter  Number Animal Letter  Number
0      c       3   lion      a       1
1      d       4  tiger      b       2

In [36]:
dict1 = {
    "city" : ["A","B","C","D","E"],
    "temperature" : [32,33,34,35,36]
}

df1 = pd.DataFrame(dict1)
df1

  city  temperature
0    A           32
1    B           33
2    C           34
3    D           35
4    E           36

In [37]:
dict2 = {
    "city" : ["C","D","E","F","G"],
    "humidity" : [65,66,67,68,69]
}

df2 = pd.DataFrame(dict2)
df2

  city  humidity
0    C        65
1    D        66
2    E        67
3    F        68
4    G        69

In [41]:
df=pd.merge(df1,df2,on='city')

In [42]:
df

  city  temperature  humidity
0    C           34        65
1    D           35        66
2    E           36        67

In [43]:
df=pd.merge(df1,df2,on='city',how='outer')

In [44]:
df

  city  temperature  humidity
0    A         32.0       NaN
1    B         33.0       NaN
2    C         34.0      65.0
3    D         35.0      66.0
4    E         36.0      67.0
5    F          NaN      68.0
6    G          NaN      69.0

In [45]:
import pandas as pd
import numpy as np

In [46]:
data = pd.Series([0, 1, 2, 3, 4, 5,np.nan, 6, 7, 8])
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    6.0
8    7.0
9    8.0
dtype: float64

In [47]:
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [48]:
dict1 = {
    0:[1,4,7,np.nan],
    1:[2,5,np.nan,np.nan],
    2:[3,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan]
}

df = pd.DataFrame(dict1)
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [49]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [50]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [51]:
df.dropna(how='all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [52]:
df.dropna(axis=1,how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [53]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [54]:
df.dropna(thresh=1)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [55]:
df.dropna(axis=1,thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [56]:
df.dropna(axis=1,thresh=2)

     0    1
0  1.0  2.0
1  4.0  5.0
2  7.0  NaN
3  NaN  NaN

In [57]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [58]:
df.fillna(50)

      0     1     2     3
0   1.0   2.0   3.0  50.0
1   4.0   5.0  50.0  50.0
2   7.0  50.0  50.0  50.0
3  50.0  50.0  50.0  50.0

In [59]:
df.fillna({0:100,1:200,2:400,3:500})

       0      1      2      3
0    1.0    2.0    3.0  500.0
1    4.0    5.0  400.0  500.0
2    7.0  200.0  400.0  500.0
3  100.0  200.0  400.0  500.0

In [60]:
df.fillna(method='ffill')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [61]:
df.fillna(method='ffill',limit=2)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  NaN NaN

In [62]:
df.fillna(method='ffill',limit=1,axis=1)

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  4.0  5.0  5.0  NaN
2  7.0  7.0  NaN  NaN
3  NaN  NaN  NaN  NaN

In [63]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [64]:
df.fillna(df.mean())

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

In [65]:
ser1 = pd.Series([1,2,100,4,5,100,7,8,100])
ser1

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [66]:
ser1.replace(100,1)

0    1
1    2
2    1
3    4
4    5
5    1
6    7
7    8
8    1
dtype: int64

In [67]:
ser1.replace([1,2,100],45)

0    45
1    45
2    45
3     4
4     5
5    45
6     7
7     8
8    45
dtype: int64

In [68]:
ser1.replace({100:23,2:21})

0     1
1    21
2    23
3     4
4     5
5    23
6     7
7     8
8    23
dtype: int64

In [69]:
ser2 = pd.Series(list('abcdeabcd'))
ser2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object